Setups/OpenFOAM-TwoPhaseFlow-setups/cases/hydrodynamic/stationaryDroplet2D_wisp/testCase/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field           alpha.dispersed;
type            cylinder;
radius          0.001;
direction       (0 0 1);
origin          (0.005 0.005 0.0);

// ************************************************************************* //
