Setups/OpenFOAM-TwoPhaseFlow-setups/cases/hydrodynamic/stationaryDroplet2D_wisp/testCase/system/vofInitDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      vofInitDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fieldName       alpha.dispersed;    // Name of the volume fraction field
algorithm       SMCA;           // Keep as it is. The alternative 'SMCI' is not available here. 
writeGeometry   off;            // Keep as it is. Writes decomposed cells as VTKs for debugging purposes.
invert          off;            // Enable if you want to switch which phase is assigned alpha=1.
writeAllFields  on;             // Write out all volume fields computed during initialization.
                                //      Intended for debugging, turn off in productive use.
checkVolume     on;             // For closed surfaces: calculate relative global volume error
                                //      of computed alpha field. Yields meaningless output if used
                                //      for open surfaces / surfaces in contact with the domain boundary.
refinementLevel 4;              // 
relError        -1;

distCalc
{
    surfaceType     levelSet;
    surface         cylinder;
    center          (0.005 0.005 0.0);
    radius          0.001;
	axis			(0 0 1);
	pointOnAxis		(0.005 0.005 -1.0);
	height			5;
    orientation     inward;
    narrowBandWidth 1.0;
    bulkValue       0.0;
}

// ************************************************************************* //
